# Pandas 05 - Update rows and columns.
Actualizar filas y columnas de un DataFrame.

In [1]:
import pandas as pd

In [2]:
persons = {
    'Name': ['Xavier', 'Maria', 'Ze', 'Buscape'],
    'Last': ['Zisu', 'Dow', 'Pequeño', 'Doas'],
    'Age': [29, 7, 39, 25],
    'Email': ['xazi@root.net','madow@edu.gob','zepe@mv.br','pics@journal.net']
}
df = pd.DataFrame(persons)
df

      Name     Last  Age             Email
0   Xavier     Zisu   29     xazi@root.net
1    Maria      Dow    7     madow@edu.gob
2       Ze  Pequeño   39        zepe@mv.br
3  Buscape     Doas   25  pics@journal.net

In [3]:
# cambiar los encabezados a mayusculas
df.columns = [n.upper() for n in df.columns]

In [4]:
df

      NAME     LAST  AGE             EMAIL
0   Xavier     Zisu   29     xazi@root.net
1    Maria      Dow    7     madow@edu.gob
2       Ze  Pequeño   39        zepe@mv.br
3  Buscape     Doas   25  pics@journal.net

Se puede utilizar los metodos upper(), lower(), title()

In [5]:
# cambiar las N por ' ' de las colummas
df.columns = df.columns.str.replace('N', ' ')

In [6]:
df

       AME     LAST  AGE             EMAIL
0   Xavier     Zisu   29     xazi@root.net
1    Maria      Dow    7     madow@edu.gob
2       Ze  Pequeño   39        zepe@mv.br
3  Buscape     Doas   25  pics@journal.net

In [7]:
df = pd.DataFrame(persons)
df

      Name     Last  Age             Email
0   Xavier     Zisu   29     xazi@root.net
1    Maria      Dow    7     madow@edu.gob
2       Ze  Pequeño   39        zepe@mv.br
3  Buscape     Doas   25  pics@journal.net

In [8]:
# renombrar columnas del DataFrame
df.rename(columns={'Name':'Nombre','Last':'Apl','Age':'Edad','Email':'Correo'}, inplace=True)

In [9]:
df

    Nombre      Apl  Edad            Correo
0   Xavier     Zisu    29     xazi@root.net
1    Maria      Dow     7     madow@edu.gob
2       Ze  Pequeño    39        zepe@mv.br
3  Buscape     Doas    25  pics@journal.net

In [10]:
# cambiar los valores de una fila
df.loc[3] = ['Zinedine','Zidane', 50, 'zisu@france.fr']

In [11]:
df

     Nombre      Apl  Edad          Correo
0    Xavier     Zisu    29   xazi@root.net
1     Maria      Dow     7   madow@edu.gob
2        Ze  Pequeño    39      zepe@mv.br
3  Zinedine   Zidane    50  zisu@france.fr

In [12]:
# actualizar solo determinadas columnas de un registro
df.loc[[3], ['Nombre','Apl']] = ['Carol', 'Doe']

In [13]:
df

   Nombre      Apl  Edad          Correo
0  Xavier     Zisu    29   xazi@root.net
1   Maria      Dow     7   madow@edu.gob
2      Ze  Pequeño    39      zepe@mv.br
3   Carol      Doe    50  zisu@france.fr

In [14]:
# pasar todo a upper en determinada fila usando una funcion
def up_mail(Correo):
    return Correo.upper()

In [15]:
df.Correo = df.Correo.apply(up_mail)

In [16]:
df

   Nombre      Apl  Edad          Correo
0  Xavier     Zisu    29   XAZI@ROOT.NET
1   Maria      Dow     7   MADOW@EDU.GOB
2      Ze  Pequeño    39      ZEPE@MV.BR
3   Carol      Doe    50  ZISU@FRANCE.FR

df.applymap(ste.lower) aplica el cambio a todas las columnas, no funciona en enteros.

In [17]:
# aplicar el upper solo a determinadas columnas y todas sus filas
df.loc[:, 'Apl'] = df.loc[:, ['Apl']].applymap(str.upper)

In [18]:
df

   Nombre      Apl  Edad          Correo
0  Xavier     ZISU    29   XAZI@ROOT.NET
1   Maria      DOW     7   MADOW@EDU.GOB
2      Ze  PEQUEÑO    39      ZEPE@MV.BR
3   Carol      DOE    50  ZISU@FRANCE.FR

In [19]:
# aplicar lower a determinadas columnas
df.iloc[:, [0,1]] = df.iloc[:, [0,1]].applymap(str.lower)

In [20]:
df

   Nombre      Apl  Edad          Correo
0  xavier     zisu    29   XAZI@ROOT.NET
1   maria      dow     7   MADOW@EDU.GOB
2      ze  pequeño    39      ZEPE@MV.BR
3   carol      doe    50  ZISU@FRANCE.FR

In [21]:
# restaurar todos los registros a lower
df.iloc[:, [0,1,3]] = df.iloc[:, [0,1,3]].applymap(str.lower)

In [22]:
df

   Nombre      Apl  Edad          Correo
0  xavier     zisu    29   xazi@root.net
1   maria      dow     7   madow@edu.gob
2      ze  pequeño    39      zepe@mv.br
3   carol      doe    50  zisu@france.fr

muestra el largo de todos los elementos del DataFrame
df.applymap(len)

In [23]:
# cambiar los elementos de la columna, si el registro a cambiar no existe, lo ingora
df['Nombre'] = df['Nombre'].replace({'maria': 'mario', 'juan': 'diana'})

In [24]:
df

   Nombre      Apl  Edad          Correo
0  xavier     zisu    29   xazi@root.net
1   mario      dow     7   madow@edu.gob
2      ze  pequeño    39      zepe@mv.br
3   carol      doe    50  zisu@france.fr